# Day 3: SQL via Python - NYC School Data Exploration

## Loading Libraries & Connecting Database

### Based on Demo

In [1]:
import pandas as pd
import psycopg2

In [2]:
conn = psycopg2.connect(
    dbname="neondb",
    user="neondb_owner",
    password="npg_CeS9fJg2azZD",
    host="ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech",
    port="5432",
    sslmode="require"  ##ssl encryption on
)
cur = conn.cursor()

### Testing connection with high_school_directory table

In [3]:
## checking columns
query="""
SELECT 
    table_schema, 
    table_name, 
    column_name, 
    data_type
FROM information_schema.columns
WHERE table_name = 'high_school_directory'
ORDER BY ordinal_position;"""
df = pd.read_sql(query, engine)
df

NameError: name 'engine' is not defined

In [ ]:
query = "SELECT * FROM nyc_schools.high_school_directory LIMIT 5;"
df = pd.read_sql(query, conn)
df.head()

,dbn,school_name,borough,building_code,phone_number,fax_number,grade_span_min,grade_span_max,expgrade_span_min,expgrade_span_max,...,number_programs,Location 1,Community Board,Council District,Census Tract,Zip Codes,Community Districts,Borough Boundaries,City Council Districts,Police Precincts
0,27Q260,Frederick Douglass Academy VI High School,Queens,Q465,718-471-2154,718-471-2890,9.0,12,None,None,...,1,"{'latitude': '40.601989336', 'longitude': '-73...",14,31,100802,20529,51,3,47,59
1,21K559,Life Academy High School for Film and Music,Brooklyn,K400,718-333-7750,718-333-7775,9.0,12,None,None,...,1,"{'latitude': '40.593593811', 'longitude': '-73...",13,47,306,17616,21,2,45,35
2,16K393,Frederick Douglass Academy IV Secondary School,Brooklyn,K026,718-574-2820,718-574-2821,9.0,12,None,None,...,1,"{'latitude': '40.692133704', 'longitude': '-73...",3,36,291,18181,69,2,49,52
3,08X305,Pablo Neruda Academy,Bronx,X450,718-824-1682,718-824-1663,9.0,12,None,None,...,1,"{'latitude': '40.822303765', 'longitude': '-73...",9,18,16,11611,58,5,31,26
4,03M485,Fiorello H. LaGuardia High School of Music & A...,Manhattan,M485,212-496-0700,212-724-5748,9.0,12,None,None,...,6,"{'latitude': '40.773670507', 'longitude': '-73...",7,6,151,12420,20,4,19,12

### Testing connection with school_demographics table

In [ ]:
query="""
SELECT 
    table_schema, 
    table_name, 
    column_name, 
    data_type
FROM information_schema.columns
WHERE table_name = 'school_demographics'
ORDER BY ordinal_position;"""
df = pd.read_sql(query, engine)
df

   table_schema           table_name        column_name          data_type
0   nyc_schools  school_demographics                dbn  character varying
1   nyc_schools  school_demographics               Name  character varying
2   nyc_schools  school_demographics         schoolyear            integer
3   nyc_schools  school_demographics         fl_percent  character varying
4   nyc_schools  school_demographics        frl_percent               real
5   nyc_schools  school_demographics   total_enrollment            integer
6   nyc_schools  school_demographics               prek  character varying
7   nyc_schools  school_demographics                  k  character varying
8   nyc_schools  school_demographics             grade1  character varying
9   nyc_schools  school_demographics             grade2  character varying
10  nyc_schools  school_demographics             grade3  character varying
11  nyc_schools  school_demographics             grade4  character varying
12  nyc_schools  school_demographics             grade5  character varying
13  nyc_schools  school_demographics             grade6  character varying
14  nyc_schools  school_demographics             grade7  character varying
15  nyc_schools  school_demographics             grade8  character varying
16  nyc_schools  school_demographics             grade9  character varying
17  nyc_schools  school_demographics            grade10  character varying
18  nyc_schools  school_demographics            grade11  character varying
19  nyc_schools  school_demographics            grade12  character varying
20  nyc_schools  school_demographics            ell_num            integer
21  nyc_schools  school_demographics        ell_percent               real
22  nyc_schools  school_demographics           sped_num            integer
23  nyc_schools  school_demographics       sped_percent               real
24  nyc_schools  school_demographics            ctt_num            integer
25  nyc_schools  school_demographics  selfcontained_num            integer
26  nyc_schools  school_demographics          asian_num            integer
27  nyc_schools  school_demographics          asian_per               real
28  nyc_schools  school_demographics          black_num            integer
29  nyc_schools  school_demographics          black_per               real
30  nyc_schools  school_demographics       hispanic_num            integer
31  nyc_schools  school_demographics       hispanic_per               real
32  nyc_schools  school_demographics          white_num            integer
33  nyc_schools  school_demographics          white_per               real
34  nyc_schools  school_demographics           male_num            integer
35  nyc_schools  school_demographics           male_per               real
36  nyc_schools  school_demographics         female_num            integer
37  nyc_schools  school_demographics         female_per               real

In [ ]:
query = "SELECT * FROM nyc_schools.school_demographics LIMIT 5;"
df = pd.read_sql(query, conn)
df.head()

,dbn,Name,schoolyear,fl_percent,frl_percent,total_enrollment,prek,k,grade1,grade2,...,black_num,black_per,hispanic_num,hispanic_per,white_num,white_per,male_num,male_per,female_num,female_per
0,01M015,P.S. 015 ROBERTO CLEMENTE,20052006,89.4,NaN,281,15,36,40,33,...,74,26.3,189,67.3,5,1.8,158,56.2,123,43.8
1,01M015,P.S. 015 ROBERTO CLEMENTE,20062007,89.4,NaN,243,15,29,39,38,...,68,28.0,153,63.0,4,1.6,140,57.6,103,42.4
2,01M015,P.S. 015 ROBERTO CLEMENTE,20072008,89.4,NaN,261,18,43,39,36,...,77,29.5,157,60.2,7,2.7,143,54.8,118,45.2
3,01M015,P.S. 015 ROBERTO CLEMENTE,20082009,89.4,NaN,252,17,37,44,32,...,75,29.8,149,59.1,7,2.8,149,59.1,103,40.9
4,01M015,P.S. 015 ROBERTO CLEMENTE,20092010,,96.5,208,16,40,28,32,...,67,32.2,118,56.7,6,2.9,124,59.6,84,40.4

### Testing connection with school_safety_report table

In [ ]:
query="""
SELECT 
    table_schema, 
    table_name, 
    column_name, 
    data_type
FROM information_schema.columns
WHERE table_name = 'school_safety_report'
ORDER BY ordinal_position;"""
df = pd.read_sql(query, engine)
df

,table_schema,table_name,column_name,data_type
0,nyc_schools,school_safety_report,school_year,text
1,nyc_schools,school_safety_report,building_code,text
2,nyc_schools,school_safety_report,dbn,text
3,nyc_schools,school_safety_report,location_name,text
4,nyc_schools,school_safety_report,location_code,text
5,nyc_schools,school_safety_report,address,text
6,nyc_schools,school_safety_report,borough,text
7,nyc_schools,school_safety_report,geographical_district_code,double precision
8,nyc_schools,school_safety_report,register,text
9,nyc_schools,school_safety_report,building_name,text
10,nyc_schools,school_safety_report,num_schools,integer
11,nyc_schools,school_safety_report,schools_in_building,text
12,nyc_schools,school_safety_report,major_n,double precision
13,nyc_schools,school_safety_report,oth_n,double precision
14,nyc_schools,school_safety_report,nocrim_n,double precision
15,nyc_schools,school_safety_report,prop_n,double precision
16,nyc_schools,school_safety_report,vio_n,double precision
17,nyc_schools,school_safety_report,engroupa,text
18,nyc_schools,school_safety_report,rangea,text
19,nyc_schools,school_safety_report,avgofmajor_n,double precision
20,nyc_schools,school_safety_report,avgofoth_n,double precision
21,nyc_schools,school_safety_report,avgofnocrim_n,double precision
22,nyc_schools,school_safety_report,avgofprop_n,double precision
23,nyc_schools,school_safety_report,avgofvio_n,double precision
24,nyc_schools,school_safety_report,borough_name,text
25,nyc_schools,school_safety_report,postcode,double precision
26,nyc_schools,school_safety_report,latitude,double precision
27,nyc_schools,school_safety_report,longitude,double precision
28,nyc_schools,school_safety_report,community_board,double precision
29,nyc_schools,school_safety_report,council_district,double precision
30,nyc_schools,school_safety_report,census_tract,double precision
31,nyc_schools,school_safety_report,bin,double precision
32,nyc_schools,school_safety_report,bbl,double precision
33,nyc_schools,school_safety_report,nta,text
34,nyc_schools,school_safety_report,_schools,integer

In [ ]:
query = "SELECT * FROM nyc_schools.school_safety_report LIMIT 5;"
df = pd.read_sql(query, conn)
df.head()

,school_year,building_code,dbn,location_name,location_code,address,borough,geographical_district_code,register,building_name,...,postcode,latitude,longitude,community_board,council_district,census_tract,bin,bbl,nta,_schools
0,2015-16,K006,17K006,P.S. 006,K006,43 SNYDER AVENUE,K,17.0,712,,...,11226.0,40.648590,-73.957138,14.0,40.0,794.0,3117230.0,3.051030e+09,Erasmus ...,1
1,2015-16,K005,16K005,P.S. 005 Dr. Ronald Mcnair,K005,820 HANCOCK STREET,K,16.0,231,,...,11233.0,40.685695,-73.922463,3.0,41.0,377.0,3039906.0,3.014900e+09,Stuyvesant Heights ...,1
2,2015-16,K003,13K003,P.S. 003 The Bedford Village,K003,50 JEFFERSON AVENUE,K,13.0,450,,...,11216.0,40.682663,-73.955338,3.0,36.0,227.0,3057406.0,3.019980e+09,Clinton Hill ...,1
3,2015-16,K002,75K141,P.S. K141,K141,655 PARKSIDE AVENUE,K,17.0,374,655 PARKSIDE AVENUE CONSOLIDATED LOCATION,...,11226.0,40.656183,-73.951583,9.0,40.0,802.0,3378201.0,3.050500e+09,Prospect Lefferts Gardens-Wingate ...,3
4,2015-16,K002,84K704,EXPLORE CHARTER SCHOOL(BS),K704,655 PARKSIDE AVENUE,K,17.0,529,655 PARKSIDE AVENUE CONSOLIDATED LOCATION,...,11226.0,40.656183,-73.951583,9.0,40.0,802.0,3378201.0,3.050500e+09,Prospect Lefferts Gardens-Wingate ...,3

## Question 1: School Distribution

### How many schools are there in each borough?
Counting the distinct dbn codes (used as unique identifiers for the schools) and grouping them by boroughs to show how many schools in each borough.

In [ ]:
query = """
SELECT borough,
       COUNT(DISTINCT(dbn)) AS school_count
FROM nyc_schools.high_school_directory
GROUP BY borough;
"""
df_result = pd.read_sql(query, conn)
df_result

/var/folders/f9/6t_vxz3j72n2c4hm_ws2nrqm0000gn/T/ipykernel_56196/3932924293.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_result = pd.read_sql(query, conn)

         borough  school_count
0          Bronx           118
1       Brooklyn           121
2      Manhattan           106
3         Queens            80
4  Staten Island            10

## Question 2: Language Learners

### What is the average % of English Language Learners (ELL) per borough?

#### Checking for distinct dbn values in school_demographics table

In the query below, I have searched for all distinct dbn values in the school demographics table and recieved the following results:
- There are only 32 distinct DBNs all of which contain the letter "M" as the 3rd digit in each cell. 
- The letter "M" represents Manhattan in the dbn. 
- This result shows an anomaly, where all of the other boroughs are not being represented in this table so the data will not return balanced insights, and comparisons.

In [ ]:
query = """
SELECT COUNT(DISTINCT(dbn))
FROM nyc_schools.school_demographics;
"""
df_result = pd.read_sql(query, conn)
df_result

/var/folders/f9/6t_vxz3j72n2c4hm_ws2nrqm0000gn/T/ipykernel_56092/2545837759.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_result = pd.read_sql(query, conn)

   count
0     32

In [ ]:
query = """
SELECT DISTINCT(dbn)
FROM nyc_schools.school_demographics
;
"""
df_result = pd.read_sql(query, conn)
df_result

       dbn
0   01M458
1   01M332
2   01M137
3   01M378
4   01M020
5   01M188
6   01M142
7   01M034
8   01M019
9   01M696
10  01M363
11  01M509
12  01M448
13  01M650
14  01M184
15  01M345
16  01M450
17  01M515
18  01M134
19  01M315
20  01M539
21  01M292
22  01M056
23  01M063
24  02M298
25  01M364
26  01M361
27  01M140
28  01M015
29  01M064
30  01M110
31  01M301

#### Answering Question 2:
The school_demographics table does not include boroughs, so I connected it to the high_school_directory table through the dbn column (despite there only being dbn values for Manhattan available in the school_demographics table).

In [ ]:
query = """
SELECT hsd.borough,
       ROUND(AVG(sd.ell_percent)::numeric, 2)
FROM nyc_schools.school_demographics AS sd
LEFT JOIN nyc_schools.high_school_directory AS hsd
ON sd.dbn = hsd.dbn
GROUP BY hsd.borough;"""

df_result = pd.read_sql(query, conn)
df_result

     borough  round
0       None  12.71
1  Manhattan   7.57

## Question 3: Schools Supporting special needs

#### Find the top 3 schools in each borough with the highest percentage of special education students (sped_percent)

- The answer to the top 3 schools offering 'sped' for each borough is not showing all of the boroughs because the school_directory table is only bringing information about Manhattan schools, based on the unique dbn values (which I addressed in question 2).

##### The top 3 schools offering special education overall (regardless of the date)

In [4]:
query = """
WITH max_demographics AS (
    SELECT
        dbn,
        MAX(sped_percent) AS max_sped_percent
    FROM nyc_schools.school_demographics
    WHERE sped_percent IS NOT NULL
    GROUP BY dbn
),
ranked_schools AS (
    SELECT
        hsd.borough,
        hsd.school_name,
        md.max_sped_percent AS sped_percent,
        ROW_NUMBER() OVER (
            PARTITION BY hsd.borough
            ORDER BY md.max_sped_percent DESC
        ) AS rank_in_borough
    FROM nyc_schools.high_school_directory AS hsd
    JOIN max_demographics md
      ON hsd.dbn = md.dbn
)
SELECT borough, school_name, sped_percent
FROM ranked_schools
WHERE rank_in_borough <= 3
ORDER BY borough, rank_in_borough;
"""

df_result = pd.read_sql(query, conn)
df_result

/var/folders/f9/6t_vxz3j72n2c4hm_ws2nrqm0000gn/T/ipykernel_56805/2611616495.py:29: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_result = pd.read_sql(query, conn)

     borough                                    school_name  sped_percent
0  Manhattan                     East Side Community School          28.8
1  Manhattan                        Marta Valle High School          25.9
2  Manhattan  Henry Street School for International Studies          25.1

## Observations

Based on the overall information provided, it is difficult to find meaningful insights as there is not enough information to compare data between each borough. It would be best to look back at the overall data collection and storing process to find where discrepancy in the data has originated from.